app/graphql/mutations/update_comment.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."id" IS NULL ORDER BY "comments"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def resolve(body:, post_id:, user_id:, id:)
      existing = Comment.where(id: :id).first