app/graphql/types/mutation_type.rb

INSERT INTO "users" ("id", "first_name", "last_name", "street", "number", "city", "postcode", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create_user(user:)
      User.create user.to_h

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = ?, "last_name" = ?, "street" = ?, "number" = ?, "city" = ?, "postcode" = ?, "country" = ?, "updated_at" = ? WHERE "users"."id" = ?
---
    def update_user(user:)
      existing = User.where(id: user[:id]).first
      existing&.update user.to_h