app/graphql/types/query_type.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def user(id:)
      User.find(id)

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
    def comment(id:)
      Comment.find(id)

SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "gabriel@gmail.com"], ["LIMIT", 1]]
---
    def login(email:, password:)
      if user = User.where(email: email).first&.authenticate(password)